# Week 2 Lab

In [39]:
#1. Loading Libraries
"""In programming, a library is a collection of functions or methods that perform different
computational actions. In short, commonly used functions or methods are provided for
within the library and hence saving you from needing to write your own code.
To load a library in Python we use the keywords: "from ... import ... as ...". The “as” is
optional and is used to give the imported library a shorter or meaningful name, for example:"""

# from matplotlib import pyplot as plt

import matplotlib.pyplot as plt

In [40]:
# 2. DataFrames in Python

import pandas as pd

df = pd.DataFrame({
'StudentID' : [264422,264423,264444,264445,264446],
'FirstName' : ['Steven','Alex','Bill','Mark','Bob'],
'EnrolYear' : [2010,2010,2011,2011,2013],
'Math' : [100,90,90,40,60],
'English' : [60,70,80,80,60]
})

In [41]:
# “df” is just a variable name for the pandas DataFrame. You can print out the new
# DataFrame to see what it looks like:
df

   StudentID FirstName  EnrolYear  Math  English
0     264422    Steven       2010   100       60
1     264423      Alex       2010    90       70
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80
4     264446       Bob       2013    60       60

In [42]:
"""Practise 1: Create another data table called "df2" that contains the height of some of the
students. It should contain the following data:"""


df2 = pd.DataFrame({
'Height' : [160,155,175,175],
'StudentID' : [264422,264423,264444,264445]
})

df2

   Height  StudentID
0     160     264422
1     155     264423
2     175     264444
3     175     264445

#2.1 Column and row selection

In [43]:
# We can select a column using its name and the bracket syntax:
df['FirstName']

0    Steven
1      Alex
2      Bill
3      Mark
4       Bob
Name: FirstName, dtype: object

In [44]:
# Or using the somewhat simpler dot notation:
df.FirstName

0    Steven
1      Alex
2      Bill
3      Mark
4       Bob
Name: FirstName, dtype: object

In [45]:
# We can also select only elements that fit certain conditions. What does the following
# command produce?
df[df['FirstName'] == 'Alex']

   StudentID FirstName  EnrolYear  Math  English
1     264423      Alex       2010    90       70

In [46]:
df['FirstName'] == 'Alex'

0    False
1     True
2    False
3    False
4    False
Name: FirstName, dtype: bool

In [47]:
# Practise 2: Show the details of the students who enrolled in the year 2011?

df[df['EnrolYear'] == 2011]

   StudentID FirstName  EnrolYear  Math  English
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80

In [48]:
# We can select rows with ever more complicated conditions, for example:
# select rows where first-name isn't 'Bob' (!= is not equal)
# and student ID is larger than 2644423
filt = (df.FirstName != 'Bob') & (df.StudentID > 264423)
df[filt]

   StudentID FirstName  EnrolYear  Math  English
2     264444      Bill       2011    90       80
3     264445      Mark       2011    40       80

## 2.2 Modifying the structure of a table

In [49]:
# It is possible to modify the structure of DataFrames in Python. For example, we might want
# to add a new column containing the total of the "Math" and "English" marks for the students.
# To do this we can simply write:
    
df['Total'] = df['Math'] + df['English']

# The code above will create a new column call “Total” and populate it with the sum from the
# two columns “Math” and “English”. Print out the table to see the result.
df

   StudentID FirstName  EnrolYear  Math  English  Total
0     264422    Steven       2010   100       60    160
1     264423      Alex       2010    90       70    160
2     264444      Bill       2011    90       80    170
3     264445      Mark       2011    40       80    120
4     264446       Bob       2013    60       60    120

In [50]:
"""Practice 3: Add a new column showing the average mark of "Math" and "English" for each
student. (Average = Total/number of subjects)"""


df['Average'] = (df['Math'] + df['English']) /2

df

   StudentID FirstName  EnrolYear  Math  English  Total  Average
0     264422    Steven       2010   100       60    160     80.0
1     264423      Alex       2010    90       70    160     80.0
2     264444      Bill       2011    90       80    170     85.0
3     264445      Mark       2011    40       80    120     60.0
4     264446       Bob       2013    60       60    120     60.0

In [51]:
"""Practice 4: Write a filter to select students who have scored more than 150 in total and who
have achieved a subject score (in Maths or English) of 90 or more. (Hint: careful with the
parenthesis)"""

filt = (df.Total > 150) & (df.Math >= 90) | (df.English >= 90)
df[filt]

   StudentID FirstName  EnrolYear  Math  English  Total  Average
0     264422    Steven       2010   100       60    160     80.0
1     264423      Alex       2010    90       70    160     80.0
2     264444      Bill       2011    90       80    170     85.0

In [52]:
# Oftentimes, we need to modify the layout of a table so that the data is in the right format for
# further processing or visualisation. In our current table we have two columns "Math" and
# "English", both of which contain student marks. We can split the information for each student
# into different rows using the "melt" command, as follows:
    
# turn column names 'Math' and 'English' into values
# for a new column 'Subject'
df = pd.melt(
    df,
    id_vars=['EnrolYear','FirstName','StudentID'],
    value_vars=['Math','English'],
    var_name='Subject')


# Print out the new table. What have we done here?
# We have taken each record (row) from the original table, and turned it into two rows. What
# does the new column "Subject" contain?

In [53]:
# Print out the new table. What have we done here?
# We have taken each record (row) from the original table, and turned it into two rows. What
# does the new column "Subject" contain?
df

   EnrolYear FirstName  StudentID  Subject  value
0       2010    Steven     264422     Math    100
1       2010      Alex     264423     Math     90
2       2011      Bill     264444     Math     90
3       2011      Mark     264445     Math     40
4       2013       Bob     264446     Math     60
5       2010    Steven     264422  English     60
6       2010      Alex     264423  English     70
7       2011      Bill     264444  English     80
8       2011      Mark     264445  English     80
9       2013       Bob     264446  English     60

In [54]:
"""Practice 5: Based on the output table, explain what the arguments "id_vars",
"value_vars", and "var_name" to the melt() command are doing."""

# "id_vars" - unique grouping to melt
# "value_vars" - column where the value is derived from
# "var_name" - name of the column

'Practice 5: Based on the output table, explain what the arguments "id_vars",\n"value_vars", and "var_name" to the melt() command are doing.'

In [55]:
# The values that were in the columns Math and English now appear in a different column
# "value". We can rename this new column to make the new table more understandable:
df.rename(columns = {'value':'Score'}, inplace = True)

In [56]:
df

   EnrolYear FirstName  StudentID  Subject  Score
0       2010    Steven     264422     Math    100
1       2010      Alex     264423     Math     90
2       2011      Bill     264444     Math     90
3       2011      Mark     264445     Math     40
4       2013       Bob     264446     Math     60
5       2010    Steven     264422  English     60
6       2010      Alex     264423  English     70
7       2011      Bill     264444  English     80
8       2011      Mark     264445  English     80
9       2013       Bob     264446  English     60


## 2.3 Merging DataFrames

In [57]:
"""Suppose now that for some reason you would like to merge the two data sets, df and df2.
We can do that simply by calling the "merge" command:"""

df3 = pd.merge(df, df2, on=['StudentID'])

In [58]:
df3

   EnrolYear FirstName  StudentID  Subject  Score  Height
0       2010    Steven     264422     Math    100     160
1       2010    Steven     264422  English     60     160
2       2010      Alex     264423     Math     90     155
3       2010      Alex     264423  English     70     155
4       2011      Bill     264444     Math     90     175
5       2011      Bill     264444  English     80     175
6       2011      Mark     264445     Math     40     175
7       2011      Mark     264445  English     80     175

In [59]:
# Practice 6: What is the difference that can you see after merging to datasets?

# Height column added
# student with studentID beyond 264445 excluded because not included in df2.

In [60]:
"""Practice 7: Print out the merged table. Based on the output, explain what you understand
about the parameter on=['StudentID']."""

# merges on the studentID

"Practice 7: Print out the merged table. Based on the output, explain what you understand\nabout the parameter on=['StudentID']."

In [61]:
# Practice 8: Looking closely at the data in the resulting DataFrame, is there a student missing
# after the merge? How can you display all students?

# Yes, student with studentID beyond 264445 excluded because not included in df2.

## 3 Reading CSV and Excel files into DataFrames

In [62]:
"""We can read DataFrames directly from a CSV file using the "read_csv" command. (CSV
stands for Comma Separated Value, meaning that the fields stored in the text file are
separated using a ‘,’, you can open the file in a text editor and have a look). Let's read in the
file uforeports.csv that's available on Moodle. In order for the Jupyter Notebook to have
access to the file, you'll need to first download it from Moodle and copy it to the Jupyter
Notebook folder (for easier access). Once you've done that, you can simply type the
following:"""

ufo_reports = pd.read_csv('uforeports.csv')

"""If you copied it to another folder, then you will need to provide the path name to the file. Print
out the first five records from the file using the "head" command:"""

'If you copied it to another folder, then you will need to provide the path name to the file. Print\nout the first five records from the file using the "head" command:'

In [63]:
ufo_reports.head() # print the first 5 records

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [64]:
# Practice 9: How can we display the last 5 records? How can we display the last record only?


ufo_reports.tail() # print the first 5 records

              City Colors Reported Shape Reported State                 Time
18236   Grant Park             NaN       TRIANGLE    IL  2000-12-31 23:00:00
18237  Spirit Lake             NaN           DISK    IA  2000-12-31 23:00:00
18238  Eagle River             NaN            NaN    WI  2000-12-31 23:45:00
18239  Eagle River             RED          LIGHT    WI  2000-12-31 23:45:00
18240         Ybor             NaN           OVAL    FL  2000-12-31 23:59:00

In [65]:
ufo_reports.tail(1) # print the first 5 records

       City Colors Reported Shape Reported State                 Time
18240  Ybor             NaN           OVAL    FL  2000-12-31 23:59:00

In [104]:
"""To read in an Excel .XLS file, we need to specify not only the filename but also the name of
the spreadsheet within the workbook. Download the file uforeports_excel.xls and
again copy it to you Jupyter Notebook folder and type:"""

conda install -c anaconda xlrd

ufo_reports_xls = pd.read_excel(
'uforeports_excel.xls',
sheet_name='uforeports')

# rianb/jupyter_nb/Week_2 Tutorial Files-20230730/

SyntaxError: invalid syntax (2090935680.py, line 5)

In [105]:
conda install -c anaconda xlrd

Collecting package metadata (current_repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 23.3.1
  latest version: 23.7.2

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.7.2



## Package Plan ##

  environment location: /Users/rianb/anaconda3

  added / updated specs:
    - xlrd


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2022.4.26  |       hca03da5_0         127 KB  anaconda
    certifi-2022.6.15          |  py310hca03da5_0         157 KB  anaconda
    xlrd-2.0.1                 |     pyhd3eb1b0_0          92 KB  anaconda
    ------------------------------------------------------------
                                           Total:         376 KB

The following NEW packages will be INSTALLED:

  xlrd               anaconda/noarch::xlrd-2.0.1-pyhd3eb1b0_0

The following packages will be SUPERSEDED by a higher-priority channel:

  ca-certificates    pkgs/main::ca-certificates-2023.05.30~ --> anaconda::ca-certificates-2022.4.26-hca03da5_0
  certifi            pkgs/main::certifi-2023.5.7-py310hca0~ --> anaconda::certifi-2022.6.15-py310hca03da5_0



Downloading and Extracting Packages
certifi-2022.6.15    | 157 KB    |                                       |   0%
ca-certificates-2022 | 127 KB    |                                       |   0%

certifi-2022.6.15    | 157 KB    | ###7                                  |  10%
ca-certificates-2022 | 127 KB    | ####6                                 |  13%
certifi-2022.6.15    | 157 KB    | ##################################### | 100%

xlrd-2.0.1           | 92 KB     | ######4                               |  17%





Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [106]:
ufo_reports_xls = pd.read_excel(
'uforeports_excel.xls',
sheet_name='uforeports')

In [109]:
"""Use the "head" command to print out the first 5 records of the new table. Notice that the
CSV file and the XLS one contained the same data, but in different formats"""
ufo_reports_xls.head()

SyntaxError: invalid syntax (2777611017.py, line 1)

In [110]:
"""It looks like Python has recognised the Time column differently for the two datasets. Let's
print out the datatype for the Time column to see what's going on:"""
print(ufo_reports.Time.dtypes)

object

In [111]:
# and do the same for the XLS version::
print(ufo_reports_xls.Time.dtypes)

datetime64[ns]

In [112]:
"""Notice that Time columns in two DataFrames are indeed different. (Note: If they both return
as objects, it is likely because your date time setting for your computer is set to US style of
Month-Day-Year. You can use the “uforeports_excel_us.xls”) In the table read in
from the CSV file, the Time column is just an object, while for the XLS file it was given a
datetime format. We can change the format so they are consistent"""

# change to datetime format
ufo_reports.Time = pd.to_datetime(ufo_reports.Time)
print (ufo_reports.Time.dtypes) # print its datatype now
ufo_reports.head() #

datetime64[ns]

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-01-06 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-01-06 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [ ]:
# Check whether it looks the same as the other dataframe Has it fixed the problem?

# yeah

# 4 Basic data auditing

In [69]:
"""We could easily do some auditing or exploration of the data using Python. We'll leave
graphical data exploration and outlier identification to next week. Instead, we'll use the titanic
data set (a list of passengers on the Titanic) to investigate some basic auditing functions."""


"""Practice 10: Write a statement to read in titanic data (titanic.csv) into a pandas
DataFrame called ‘titanic’. Then print out the first few rows."""


titanic = pd.read_csv('titanic.csv')

In [72]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [73]:
# We'll now check various characteristics of the data. First let's have a look at the dimensions
# of the table:

print(titanic.shape)

(891, 15)

In [74]:
# How many rows and columns are there?

# (rows, columns)

In [76]:
# We can investigate the data types of each column, by calling "dtypes" on the entire
# DataFrame:

titanic.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [77]:
# We can do summary statistics to see the count, number of unique values, as well as the
# value range of numeric fields.

titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [78]:
# What does the describe method print out?

# Summary of table

In [79]:
# We can have a look at the unique values for each column using the "value_counts()"
# method:

titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [80]:
# Practice 11: Share your findings of the previous two statements with other students, e.g.
# what is the average age of the Titanic’s passengers, and the mode?

# 5 Aggregation and group-by

In [81]:
"""Continuing with the titanic data set, let's now focus on the age of passengers. We've already
seen that we can calculate the average value of a column using the describe() function.
Alternatively, we could make use of the "mean()" function directly, by typing:"""

titanic['age'].mean()

29.69911764705882

In [82]:
"""There are many other aggregation functions we might wish to use to investigate the age of
the passengers. For example:"""

titanic['age'].max() # oldest

80.0

In [83]:
titanic['age'].min() # youngest

0.42

In [84]:
titanic['age'].sum() # total years

21205.17

In [85]:
titanic['age'].std() # standard deviation

14.526497332334044

In [86]:
titanic['age'].median() # half of the people were older (/younger)

28.0

In [87]:
"""Knowing the average age over all passengers is interesting, but knowing the average age for
different groups of passengers may be more useful. We could then answer questions like:
How old were the first-class passengers on average? Was the average age the same for
men and women? And so on .."""

"""Let's now have a more detailed look at the age of different groups. We can do that simply by
making use of the groupby() command. We'll use the command to create a (hierarchical)
index on "sex" and "class" values, so that we can then compute aggregate values (the
mean) over each of the groups:"""

sex_class = titanic.groupby(['sex','class'])['age']
sex_class.mean()

sex     class
female  First     34.611765
        Second    28.722973
        Third     21.750000
male    First     41.281386
        Second    30.740707
        Third     26.507589
Name: age, dtype: float64

In [89]:
"""Practice 12: Interpret the output, e.g. what did you notice about the average age of the
Titanic’s passengers in regards to their classes? How about the relationship between age
and gender?"""


# people in higher classes are older

# males are older in general

In [90]:
"""Practice 13: Use other aggregation functions and groupings to determine which class had
the oldest and youngest passengers and which gender had the largest amount of variation in
age (standard deviation)."""


sex_class.max()

sex     class
female  First     63.0
        Second    57.0
        Third     63.0
male    First     80.0
        Second    70.0
        Third     74.0
Name: age, dtype: float64

In [91]:
sex_class.min()

sex     class
female  First     2.00
        Second    2.00
        Third     0.75
male    First     0.92
        Second    0.67
        Third     0.42
Name: age, dtype: float64

In [92]:
sex_class.std()

sex     class
female  First     13.612052
        Second    12.872702
        Third     12.729964
male    First     15.139570
        Second    14.793894
        Third     12.159514
Name: age, dtype: float64

In [4]:
print("hi")

hi